## Check numerical sequence

In [48]:
import pandas as pd
import itertools

Option 1 is to pick a column as a list and do the trick with standard python list tools

In [49]:
df= pd.read_excel("./test_data/data.xlsx")
field_to_check="customer_id"

In [57]:
df.shape

(933, 9)

In [58]:
df.head()

,customer_id,gender,first_name,last_name,dob,date_enrollment,city,country,residential address
0,1,F,April,Wade,2005-01-06,2011-12-25,Mistyfort,Jersey,7919 Thomas Parkway Suite 159
1,2,M,Eric,Cruz,2017-06-15,2008-10-18,Calderontown,Australia,866 April Glens Suite 576
2,3,M,Shawn,Anthony,2017-06-25,2008-03-14,Lake Eric,Andorra,69675 Lopez Crest
3,4,M,Elijah,Quinn,2008-09-18,2008-12-02,North Sandrabury,Germany,95304 Joan Ports Apt. 316
4,5,F,Shannon,Mckay,1996-09-27,2005-01-18,West Carol,British Virgin Islands,738 Lori Mill

In [59]:
list_to_check= df[field_to_check].tolist()
# here the key command is "set" which picks only unique values.
# note that this means that we dont check for duplicates or
# non numeric, blanks etc, this should be done beforehand

list_to_check=sorted(set(list_to_check))

gap_list=[]
n= 0
for el in list_to_check:
    if n==0:
        n= el-1    
    if el-n > 1:
        gap_list.extend(range(n+1,el))
    n=el
print(len(gap_list))
print(gap_list)

67
[33, 37, 62, 85, 117, 162, 183, 202, 203, 250, 256, 295, 299, 331, 343, 358, 380, 407, 417, 428, 437, 439, 446, 479, 499, 561, 568, 569, 570, 571, 572, 573, 574, 575, 576, 577, 592, 604, 631, 632, 657, 660, 668, 685, 687, 705, 790, 801, 811, 813, 814, 821, 844, 847, 866, 873, 943, 944, 945, 946, 947, 958, 981, 985, 988, 991, 994]

this optional routine converts it to pair of ranges, which can be useful if the gaps are clustered

In [53]:
def to_ranges(iterable):
    iterable = sorted(set(iterable))
    for key, group in itertools.groupby(enumerate(iterable), lambda t: t[1] - t[0]):
        group = list(group)
        yield [group[0][1], group[-1][1],group[-1][1]-group[0][1]+1]

df_grouped = pd.DataFrame.from_records(list(to_ranges(gap_list)),columns=["start","end","count"])
df_grouped

    start  end  count
0      33   33      1
1      37   37      1
2      62   62      1
3      85   85      1
4     117  117      1
5     162  162      1
6     183  183      1
7     202  203      2
8     250  250      1
9     256  256      1
10    295  295      1
11    299  299      1
12    331  331      1
13    343  343      1
14    358  358      1
15    380  380      1
16    407  407      1
17    417  417      1
18    428  428      1
19    437  437      1
20    439  439      1
21    446  446      1
22    479  479      1
23    499  499      1
24    561  561      1
25    568  577     10
26    592  592      1
27    604  604      1
28    631  632      2
29    657  657      1
30    660  660      1
31    668  668      1
32    685  685      1
33    687  687      1
34    705  705      1
35    790  790      1
36    801  801      1
37    811  811      1
38    813  814      2
39    821  821      1
40    844  844      1
41    847  847      1
42    866  866      1
43    873  873      1
44    943  947      5
45    958  958      1
46    981  981      1
47    985  985      1
48    988  988      1
49    991  991      1
50    994  994      1

In [54]:
df_grouped.to_excel("./output/Sequence Gaps Grouped.xlsx",index=False)

Option 2 is to do everything with panda data frames, iterating through each record, having previously sorted by the target column/field
Could be slower than using the previous option (using Lists) as Python is very fast with lists.

In [60]:
df.sort_values(by=[field_to_check], inplace=True)
gap_list=[]
n= 0
for index, row in df.iterrows():
    if n==0:
        n= row[field_to_check]-1    
    if (row[field_to_check]-n) > 1:
        gap_list.extend(range(n+1,row[field_to_check]))
    n=row[field_to_check]
print(gap_list)

[33, 37, 62, 85, 117, 162, 183, 202, 203, 250, 256, 295, 299, 331, 343, 358, 380, 407, 417, 428, 437, 439, 446, 479, 499, 561, 568, 569, 570, 571, 572, 573, 574, 575, 576, 577, 592, 604, 631, 632, 657, 660, 668, 685, 687, 705, 790, 801, 811, 813, 814, 821, 844, 847, 866, 873, 943, 944, 945, 946, 947, 958, 981, 985, 988, 991, 994]

In [61]:
df2 = pd.DataFrame({'id':gap_list})
df2.to_excel("./output/Sequence Gaps.xlsx")
print(len(gap_list))
#df2

67

All done!!!